In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r'C:/Users/SUDEEP/Downloads/data.csv')
df

    firstname  lastname                       email  age
0         Cam     Ingra       Cam.Ingra@outlook.com   40
1       Robbi  Hourigan    Robbi.Hourigan@yahoo.com   50
2      Florie    Pattin   Florie.Pattin@outlook.com   44
3    Cindelyn   Brunell  Cindelyn.Brunell@gmail.com   60
4       Danny   Goldina     Danny.Goldina@yahoo.com   30
..        ...       ...                         ...  ...
992   Julieta   Weinreb   Julieta.Weinreb@yahoo.com   19
993    Danika   Germann  Danika.Germann@outlook.com   24
994    Dorene   Erminia  Dorene.Erminia@outlook.com   34
995   Sidoney   Suzetta   Sidoney.Suzetta@yahoo.com   49
996    Phylis    Dorine   Phylis.Dorine@outlook.com   33

[997 rows x 4 columns]

In [3]:
df.isnull()

     firstname  lastname  email    age
0        False     False  False  False
1        False     False  False  False
2        False     False  False  False
3        False     False  False  False
4        False     False  False  False
..         ...       ...    ...    ...
992      False     False  False  False
993      False     False  False  False
994      False     False  False  False
995      False     False  False  False
996      False     False  False  False

[997 rows x 4 columns]

In [4]:
df.isnull().sum()

firstname    0
lastname     0
email        0
age          0
dtype: int64

In [ ]:
df.dropna()    # drop all the rows which are consisting null values
               # by default axis = 0 means all rows
               # if axis = 1 means it will check for null values in columns and if columns consists null values then it will remove columns

In [ ]:
df.dropna(how = 'any')        # if any row value is null then remove that row

In [ ]:
df.dropna(how = 'all')        # if all row vales are null then remove that row

In [ ]:
df.dropna(inplace = True)     # replaces the null values and creates a new DataFrame

In [ ]:
df.fillna(0)         # to fill up all the null values with defined integer

In [ ]:
df.fillna({'physics':'none','chemistry':30,'maths':65}) # keys are the column name values will replace the null values with the defined interger

In [ ]:
df.fillna(method = 'ffill') # ffill is a forward fill
                            # fill the null values with the previous row values

In [ ]:
df.fillna(method = 'ffill', axis = 1)  #values of the previous column

In [ ]:
df['physics'].fillna(value=df['physics'].mean())

In [ ]:
df.fillna(method = 'bfill')

In [ ]:
df.replace(to_replace = 26 , value = 30)
df.replace(34,1000)
df.replace(to_replace=[3,4,5,6,7,8,8,12], value='A')
df.replace(to_replace=[3,4,5,6], value=['A','B','C','D'])

In [ ]:
df['physics'].replace(to_replace=[3,4,5,6], value=['A','B','C','D'], inplace = True)
df.replace('[A-Za-z]',0, regex = True)  #string literals will be replaced by zero